20-rails-associations/airline/app/controllers/jets_controller.rb

  def new
    @thing = Jet.new
    @jet_companies = JetCompany.all
---
SELECT "jet_companies".* FROM "jet_companies"

  def create
    @jet = Jet.create(jet_params)
---
INSERT INTO "jets" ("model", "seats", "range", "jet_company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["model", "Boeing 777"], ["seats", 124], ["range", 341], ["jet_company_id", 16], ["created_at", "2019-10-15 19:29:52.761842"], ["updated_at", "2019-10-15 19:29:52.761842"]]

  def show
    @jet = Jet.find(params[:id])
---
SELECT "jets".* FROM "jets" WHERE "jets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]