21-rails-validations/halloween/app/views/victims/new.html.erb

SELECT "monsters".* FROM "monsters"
---
  <br>
  <%= f.collection_select :monster_id, Monster.all, :id, :name, prompt: true %>